Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MX_DFP/1.5.259/atdf/PIC32MX360F256L.atdf
      <value-group caption="Channel Transfer Abort Interrupt Enable bit" name="DCH3INT__CHTAIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Transfer Complete Interrupt Enable bit" name="DCH3INT__CHCCIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Block Transfer Complete Interrupt Enable bit" name="DCH3INT__CHBCIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Half Full Interrupt Enable bit" name="DCH3INT__CHDHIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Done Interrupt Enable bit" name="DCH3INT__CHDDIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Half Empty Interrupt Enable bit" name="DCH3INT__CHSHIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Done Interrupt Enable bit" name="DCH3INT__CHSDIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Start Address bits" name="DCH0DSA__CHDSA">
         <value caption="Physical start address 0x00000000" name="" value="0x0" />
         <value caption="Physical start address 0x00000001" name="" value="0x1" />
         <value caption="Physical start address 0x00000002" name="" value="0x2" />
         <value caption="Physical start address 0xffffffff" name="" value="4294967295" />
      </value-group>
      <value-group caption="Channel Destination Start Address bits" name="DCH1DSA__CHDSA">
         <value caption="Physical start address 0x00000000" name="" value="0x0" />
         <value caption="Physical start address 0x00000001" name="" value="0x1" />
         <value caption="Physical start address 0x00000002" name="" value="0x2" />
         <value caption="Physical start address 0xffffffff" name="" value="4294967295" />
      </value-group>
      <value-group caption="Channel Destination Start Address bits" name="DCH2DSA__CHDSA">
         <value caption="Physical start address 0x00000000" name="" value="0x0" />
         <value caption="Physical start address 0x00000001" name="" value="0x1" />
         <value caption="Physical start address 0x00000002" name="" value="0x2" />
         <value caption="Physical start address 0xffffffff" name="" value="4294967295" />
      </value-group>
      <value-group caption="Channel Destination Start Address bits" name="DCH3DSA__CHDSA">
         <value caption="Physical start address 0x00000000" name="" value="0x0" />
         <value caption="Physical start address 0x00000001" name="" value="0x1" />
         <value caption="Physical start address 0x00000002" name="" value="0x2" />
         <value caption="Physical start address 0xffffffff" name="" value="4294967295" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH0SSIZ__CHSSIZ">
         <value caption="65535 byte source size" name="" value="0xffff" />
         <value caption="65534 byte source size" name="" value="0xfffe" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH1SSIZ__CHSSIZ">
         <value caption="65535 byte source size" name="" value="0xffff" />
         <value caption="65534 byte source size" name="" value="0xfffe" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH2SSIZ__CHSSIZ">
         <value caption="65535 byte source size" name="" value="0xffff" />
         <value caption="65534 byte source size" name="" value="0xfffe" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH3SSIZ__CHSSIZ">
         <value caption="65535 byte source size" name="" value="0xffff" />
         <value caption="65534 byte source size" name="" value="0xfffe" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH0DSIZ__CHDSIZ">
         <value caption="65535 byte destination size" name="" value="0xffff" />
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH1DSIZ__CHDSIZ">
         <value caption="65535 byte destination size" name="" value="0xffff" />
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH2DSIZ__CHDSIZ">
         <value caption="65535 byte destination size" name="" value="0xffff" />
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH3DSIZ__CHDSIZ">
         <value caption="65535 byte destination size" name="" value="0xffff" />
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Pointer bits" name="DCH0SPTR__CHSPTR">
         <value caption="Points to byte 65535 of the source" name="" value="0xffff" />
         <value caption="Points to byte 1 of the source" name="" value="0x1" />
         <value caption="Points to byte 0 of the source" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Pointer bits" name="DCH1SPTR__CHSPTR">
         <value caption="Points to byte 65535 of the source" name="" value="0xffff" />
         <value caption="Points to byte 1 of the source" name="" value="0x1" />
         <value caption="Points to byte 0 of the source" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Pointer bits" name="DCH2SPTR__CHSPTR">
         <value caption="Points to byte 65535 of the source" name="" value="0xffff" />
         <value caption="Points to byte 1 of the source" name="" value="0x1" />
         <value caption="Points to byte 0 of the source" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Pointer bits" name="DCH3SPTR__CHSPTR">
         <value caption="Points to byte 65535 of the source" name="" value="0xffff" />
         <value caption="Points to byte 1 of the source" name="" value="0x1" />
         <value caption="Points to byte 0 of the source" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH0DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff" />
         <value caption="Points to byte 1 of the destination" name="" value="0x1" />
         <value caption="Points to byte 0 of the destination" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH1DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff" />
         <value caption="Points to byte 1 of the destination" name="" value="0x1" />
         <value caption="Points to byte 0 of the destination" name="" value="0x0" />
      </value-group>
