Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MX_DFP/1.5.259/atdf/PIC32MX360F256L.atdf
      <value-group caption="Receive Overflow Flag bit" name="I2C1STAT__I2COV">
         <value caption="A byte was received while the I2CxRCV register is still holding the previous byte" name="" value="0x1" />
         <value caption="No overflow" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Collision Detect bit" name="I2C1STAT__IWCOL">
         <value caption="An attempt to write the I2CxTRN register failed because the I2C module is busy" name="" value="0x1" />
         <value caption="No collision" name="" value="0x0" />
      </value-group>
      <value-group caption="10-bit Address Status bit" name="I2C1STAT__ADD10">
         <value caption="10-bit address was matched" name="" value="0x1" />
         <value caption="10-bit address was not matched" name="" value="0x0" />
      </value-group>
      <value-group caption="General Call Status bit" name="I2C1STAT__GCSTAT">
         <value caption="General call address was received" name="" value="0x1" />
         <value caption="General call address was not received" name="" value="0x0" />
      </value-group>
      <value-group caption="Master Bus Collision Detect bit" name="I2C1STAT__BCL">
         <value caption="A bus collision has been detected during a master operation" name="" value="0x1" />
         <value caption="No collision" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Status bit (when operating as I2C master, applicable to master transmit operation)" name="I2C1STAT__TRSTAT">
         <value caption="Master transmit is in progress (8 bits + ACK)" name="" value="0x1" />
         <value caption="Master transmit is not in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="Acknowledge Status bit (when operating as I2C master, applicable to master transmit operation)" name="I2C1STAT__ACKSTAT">
         <value caption="Acknowledge was not received from slave" name="" value="0x1" />
         <value caption="Acknowledge was received from slave" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Full Status bit" name="I2C2STAT__TBF">
         <value caption="Transmit in progress I2CxTRN is full" name="" value="0x1" />
         <value caption="Transmit complete I2CxTRN is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Full Status bit" name="I2C2STAT__RBF">
         <value caption="Receive complete I2CxRCV is full" name="" value="0x1" />
         <value caption="Receive not complete I2CxRCV is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Read/Write Information bit (when operating as I2C slave)" name="I2C2STAT__R_W">
         <value caption="Read indicates data transfer is output from slave" name="" value="0x1" />
         <value caption="Write indicates data transfer is input to slave" name="" value="0x0" />
      </value-group>
      <value-group caption="Start bit" name="I2C2STAT__S">
         <value caption="Indicates that a Start (or Repeated Start) bit has been detected last" name="" value="0x1" />
         <value caption="Start bit was not detected last" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop bit" name="I2C2STAT__P">
         <value caption="Indicates that a Stop bit has been detected last" name="" value="0x1" />
         <value caption="Stop bit was not detected last" name="" value="0x0" />
      </value-group>
      <value-group caption="Data/Address bit (when operating as I2C slave)" name="I2C2STAT__D_A">
         <value caption="Indicates that the last byte received was data" name="" value="0x1" />
         <value caption="Indicates that the last byte received was device address" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Overflow Flag bit" name="I2C2STAT__I2COV">
         <value caption="A byte was received while the I2CxRCV register is still holding the previous byte" name="" value="0x1" />
         <value caption="No overflow" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Collision Detect bit" name="I2C2STAT__IWCOL">
         <value caption="An attempt to write the I2CxTRN register failed because the I2C module is busy" name="" value="0x1" />
         <value caption="No collision" name="" value="0x0" />
      </value-group>
      <value-group caption="10-bit Address Status bit" name="I2C2STAT__ADD10">
         <value caption="10-bit address was matched" name="" value="0x1" />
         <value caption="10-bit address was not matched" name="" value="0x0" />
      </value-group>
      <value-group caption="General Call Status bit" name="I2C2STAT__GCSTAT">
         <value caption="General call address was received" name="" value="0x1" />
         <value caption="General call address was not received" name="" value="0x0" />
      </value-group>
      <value-group caption="Master Bus Collision Detect bit" name="I2C2STAT__BCL">
         <value caption="A bus collision has been detected during a master operation" name="" value="0x1" />
         <value caption="No collision" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Status bit (when operating as I2C master, applicable to master transmit operation)" name="I2C2STAT__TRSTAT">
         <value caption="Master transmit is in progress (8 bits + ACK)" name="" value="0x1" />
         <value caption="Master transmit is not in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="Acknowledge Status bit (when operating as I2C master, applicable to master transmit operation)" name="I2C2STAT__ACKSTAT">
         <value caption="Acknowledge was not received from slave" name="" value="0x1" />
         <value caption="Acknowledge was received from slave" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00740" name="ICAP" version="1">
      <register-group name="ICAP">
         <register caption="Input Capture 1 Control Register" name="IC1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC1CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit (read-only)" mask="0x00000008" name="ICBNE" values="IC1CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit (read-only)" mask="0x00000010" name="ICOV" values="IC1CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC1CON__ICI" />
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC1CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC1CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC1CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC1CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC1CON__ON" />
         </register>
