Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MX_DFP/1.5.259/atdf/PIC32MX360F256L.atdf
      <value-group caption="PMP Module TTL Input Buffer Select bit" name="PMCON__PMPTTL">
         <value caption="PMP module uses TTL input buffers" name="" value="0x1" />
         <value caption="PMP module uses Schmitt Trigger input buffer" name="" value="0x0" />
      </value-group>
      <value-group caption="Address/Data Multiplexing Selection bits" name="PMCON__ADRMUX">
         <value caption="All 16 bits of address are multiplexed on PMD(15:0) pins" name="" value="0x3" />
         <value caption="All 16 bits of address are multiplexed on PMD(7:0) pins" name="" value="0x2" />
         <value caption="Lower 8 bits of address are multiplexed on PMD(7:0) pins, upper bits are on PMA(15:8)" name="" value="0x1" />
         <value caption="Address and data appear on separate pins" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="PMCON__SIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Parallel Master Port Enable bit" name="PMCON__ON">
         <value caption="PMP is enabled" name="" value="0x1" />
         <value caption="PMP is disabled, no off-chip access performed" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Hold After Read/Write Strobe Wait States bits" name="PMMODE__WAITE">
         <value caption="(for write operations) Wait of 4 TPB / (for read operations) Wait of 3 TPB" name="" value="0x3" />
         <value caption="(for write operations) Wait of 3 TPB / (for read operations) Wait of 2 TPB" name="" value="0x2" />
         <value caption="(for write operations) Wait of 2 TPB / (for read operations) Wait of 1 TPB" name="" value="0x1" />
         <value caption="(for write operations) Wait of 1 TPB (default) / (for read operations) Wait of 0 TPB (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Read/Write Strobe Wait States bits" name="PMMODE__WAITM">
         <value caption="Wait of 16TPB" name="" value="0xf" />
         <value caption="Wait of 15TPB" name="" value="0xe" />
         <value caption="Wait of 14TPB" name="" value="0xd" />
         <value caption="Wait of 13TPB" name="" value="0xc" />
         <value caption="Wait of 12TPB" name="" value="0xb" />
         <value caption="Wait of 11TPB" name="" value="0xa" />
         <value caption="Wait of 10TPB" name="" value="0x9" />
         <value caption="Wait of 9TPB" name="" value="0x8" />
         <value caption="Wait of 8TPB" name="" value="0x7" />
         <value caption="Wait of 7TPB" name="" value="0x6" />
         <value caption="Wait of 6TPB" name="" value="0x5" />
         <value caption="Wait of 5TPB" name="" value="0x4" />
         <value caption="Wait of 4TPB" name="" value="0x3" />
         <value caption="Wait of 3TPB" name="" value="0x2" />
         <value caption="Wait of 2TPB" name="" value="0x1" />
         <value caption="Wait of 1TPB (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Setup to Read/Write Strobe Wait States bits" name="PMMODE__WAITB">
         <value caption="Data wait of 4 TPB; multiplexed address phase of 4 TPB" name="" value="0x3" />
         <value caption="Data wait of 3 TPB; multiplexed address phase of 3 TPB" name="" value="0x2" />
         <value caption="Data wait of 2 TPB; multiplexed address phase of 2 TPB" name="" value="0x1" />
         <value caption="Data wait of 1 TPB; multiplexed address phase of 1 TPB (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Parallel Port Mode Select bits" name="PMMODE__MODE">
         <value caption="Master mode 1 (PMCS1, PMRD/PMWR, PMENB, PMA, and PMD)" name="" value="0x3" />
         <value caption="Master mode 2 (PMCS1, PMRD, PMWR, PMA, and PMD)" name="" value="0x2" />
         <value caption="Enhanced Slave mode (PMRD, PMWR, PMCS1, PMD, and PMA)" name="" value="0x1" />
         <value caption="Legacy Parallel Slave Port (PMRD, PMWR, PMCS1, and PMD)" name="" value="0x0" />
      </value-group>
      <value-group caption="Increment Mode bits" name="PMMODE__INCM">
         <value caption="Slave mode read and write buffers auto-increment (MODE(1:0) = 00 only)" name="" value="0x3" />
         <value caption="Decrement ADDR(15:0) by 1 every read/write cycle" name="" value="0x2" />
         <value caption="Increment ADDR(15:0) by 1 every read/write cycle" name="" value="0x1" />
         <value caption="No increment or decrement of address" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Request Mode bits" name="PMMODE__IRQM">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Interrupt generated when Read Buffer 3 is read or Write Buffer 3 is written (Buffered PSP mode) or on a read or write operation when PMA(1:0) =11 (Addressable Slave mode only)" name="" value="0x2" />
         <value caption="Interrupt generated at the end of the read/write cycle" name="" value="0x1" />
         <value caption="No Interrupt generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Busy bit (Master mode only)" name="PMMODE__BUSY">
         <value caption="Port is busy" name="" value="0x1" />
         <value caption="Port is not busy" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select bit" name="PMADDR__CS">
         <value caption="Chip Select 1 and 2 are active" name="" value="0x3" />
         <value caption="Chip Select 1 is inactive, Chip Select 2 is active" name="" value="0x2" />
         <value caption="Chip Select 1 is active, Chip Select 2 is inactive" name="" value="0x1" />
         <value caption="Chip Select 1 and 2 are inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 1 bit" name="PMADDR__CS1">
         <value caption="Chip Select 1 is active" name="" value="0x4000" />
         <value caption="Chip Select 1 is inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 2 bit" name="PMADDR__CS2">
         <value caption="Chip Select 2 is active" name="" value="0x8000" />
         <value caption="Chip Select 2 is inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="Port Data Output bits" name="PMDOUT__DATAOUT">
         <value caption="Data output is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Port Data Input bits" name="PMDIN__DATAIN">
         <value caption="Data input is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="PMALH/PMALL Strobe Enable bits" name="PMAEN__PTEN">
         <value caption="PMA14 functions as either PMA(14) or PMCS1" name="" value="0x4000" />
         <value caption="PMA14 functions as port I/O" name="" value="0x0" />
         <value caption="PMA(10:2) function as PMP address lines" name="" value="0x4" />
         <value caption="PMA(10:2) function as port I/O" name="" value="0x0" />
         <value caption="PMA1 and PMA0 function as either PMA(1:0) or PMALH and PMALL" name="" value="0x1" />
         <value caption="PMA1 and PMA0 pads function as port I/O" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer 0 Status Empty bit" name="PMSTAT__OB0E">
         <value caption="Output buffer is empty (writing data to the buffer will clear this bit)" name="" value="0x1" />
         <value caption="Output buffer contains data that has not been transmitted" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer 1 Status Empty bit" name="PMSTAT__OB1E">
         <value caption="Output buffer is empty (writing data to the buffer will clear this bit)" name="" value="0x1" />
         <value caption="Output buffer contains data that has not been transmitted" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer 2 Status Empty bit" name="PMSTAT__OB2E">
         <value caption="Output buffer is empty (writing data to the buffer will clear this bit)" name="" value="0x1" />
         <value caption="Output buffer contains data that has not been transmitted" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer 3 Status Empty bit" name="PMSTAT__OB3E">
         <value caption="Output buffer is empty (writing data to the buffer will clear this bit)" name="" value="0x1" />
         <value caption="Output buffer contains data that has not been transmitted" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer Underflow Status bit" name="PMSTAT__OBUF">
         <value caption="A read occurred from an empty output byte buffer (must be cleared in software)" name="" value="0x1" />
         <value caption="No underflow occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer Empty Status bit" name="PMSTAT__OBE">
         <value caption="All readable output buffer registers are empty" name="" value="0x1" />
         <value caption="Some or all of the readable output buffer registers are full" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer 0 Status Full bit" name="PMSTAT__IB0F">
         <value caption="Input Buffer contains data that has not been read (reading buffer will clear this bit)" name="" value="0x1" />
         <value caption="Input Buffer does not contain any unread data" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer 1 Status Full bit" name="PMSTAT__IB1F">
         <value caption="Input Buffer contains data that has not been read (reading buffer will clear this bit)" name="" value="0x1" />
         <value caption="Input Buffer does not contain any unread data" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer 2 Status Full bit" name="PMSTAT__IB2F">
         <value caption="Input Buffer contains data that has not been read (reading buffer will clear this bit)" name="" value="0x1" />
         <value caption="Input Buffer does not contain any unread data" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer 3 Status Full bit" name="PMSTAT__IB3F">
         <value caption="Input Buffer contains data that has not been read (reading buffer will clear this bit)" name="" value="0x1" />
         <value caption="Input Buffer does not contain any unread data" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer Overflow Status bit" name="PMSTAT__IBOV">
         <value caption="A write attempt to a full input byte buffer occurred (must be cleared in software)" name="" value="0x1" />
         <value caption="No overflow occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer Full Status bit" name="PMSTAT__IBF">
         <value caption="All writable input buffer registers are full" name="" value="0x1" />
         <value caption="Some or all of the writable input buffer registers are empty" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00868" name="PORT" version="">
      <register-group name="PORT">
         <register caption="" name="TRISA" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISA" />
            <bitfield mask="0x00000002" name="TRISA" />
            <bitfield mask="0x00000004" name="TRISA" />
            <bitfield mask="0x00000008" name="TRISA" />
            <bitfield mask="0x00000010" name="TRISA" />
            <bitfield mask="0x00000020" name="TRISA" />
            <bitfield mask="0x00000040" name="TRISA" />
            <bitfield mask="0x00000080" name="TRISA" />
            <bitfield mask="0x00000100" name="TRISA" />
            <bitfield mask="0x00000200" name="TRISA" />
            <bitfield mask="0x00000400" name="TRISA" />
            <bitfield mask="0x00000800" name="TRISA" />
            <bitfield mask="0x00001000" name="TRISA" />
            <bitfield mask="0x00002000" name="TRISA" />
            <bitfield mask="0x00004000" name="TRISA" />
            <bitfield mask="0x00008000" name="TRISA" />
         </register>
         <register caption="" name="TRISB" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISB" />
            <bitfield mask="0x00000002" name="TRISB" />
            <bitfield mask="0x00000004" name="TRISB" />
            <bitfield mask="0x00000008" name="TRISB" />
            <bitfield mask="0x00000010" name="TRISB" />
            <bitfield mask="0x00000020" name="TRISB" />
            <bitfield mask="0x00000040" name="TRISB" />
            <bitfield mask="0x00000080" name="TRISB" />
            <bitfield mask="0x00000100" name="TRISB" />
            <bitfield mask="0x00000200" name="TRISB" />
            <bitfield mask="0x00000400" name="TRISB" />
            <bitfield mask="0x00000800" name="TRISB" />
            <bitfield mask="0x00001000" name="TRISB" />
            <bitfield mask="0x00002000" name="TRISB" />
            <bitfield mask="0x00004000" name="TRISB" />
            <bitfield mask="0x00008000" name="TRISB" />
         </register>
